INSERT INTO team
    (id, team_name)
VALUES (1, '두산 베어스'),
       (2, 'SSG 랜더스'),
       (3, '기아 타이거즈'),
       (4, '키움 히어로즈'),
       (5, '한화 이글스'),
       (6, '롯데 자이언츠');

INSERT INTO record
    (id, player_name, at_bat, hits, `outs`, average)
VALUES
--  두산 베어스
    (1, '허경민', 2, 1, 1, 0.500),
    (2, '오재원', 2, 2, 0, 1.000),
    (3, '페르난데스', 2, 0, 2, 0.000),
    (4, '박건우', 2, 0, 2, 0.000),
    (5, '조수행', 2, 0, 2, 0.000),
    (6, '김재환', 2, 1, 1, 0.500),
    (7, '안권수', 2, 2, 2, 1.000),
    (8, '권민석', 2, 1, 1, 0.500),
    (9, '유희관', 2, 0, 0, 0.000),
--  ssg 랜더스
    (10, '최정', 2, 2, 2, 1.000),
    (11, '추신수', 2, 1, 1, 0.500),
    (12, '김성현', 2, 0, 2, 0.000),
    (13, '로맥', 2, 2, 2, 1.000),
    (14, '오태곤', 2, 0, 2, 0.000),
    (15, '정의윤', 2, 1, 1, 0.500),
    (16, '김강민', 2, 0, 2, 0.000),
    (17, '이재원', 2, 1, 1, 0.500),
    (18, '김광현', 2, 1, 1, 0.500),
-- 기아 타이거즈
    (19, '나지완', 2, 1, 1, 0.500),
    (20, '최형우', 2, 0, 2, 0.000),
    (21, '김선빈', 2, 1, 1, 0.500),
    (22, '터커', 2, 2, 2, 1.000),
    (23, '이우성', 2, 0, 2, 0.000),
    (24, '김민식', 2, 1, 1, 0.500),
    (25, '나주환', 2, 2, 2, 1.000),
    (26, '한승택', 2, 0, 2, 0.000),
    (27, '멩덴', 2, 1, 1, 0.500),
-- 키움 히어로즈
    (28, '이정후', 2, 0, 2, 0.000),
    (29, '박병호', 2, 1, 1, 0.500),
    (30, '이용규', 2, 2, 2, 1.000),
    (31, '허정협', 2, 2, 2, 1.000),
    (32, '김혜성', 2, 1, 1, 0.500),
    (33, '서건창', 2, 2, 2, 1.000),
    (34, '신준우', 2, 2, 2, 1.000),
    (35, '프레이타', 2, 1, 1, 0.500),
    (36, '최원태', 2, 2, 2, 1.000),
--  한화 이글스
    (37, '정은원', 2, 0, 2, 0.000),
    (38, '노수광', 2, 2, 2, 1.000),
    (39, '하주석', 2, 2, 2, 1.000),
    (40, '힐리', 2, 0, 2, 0.000),
    (41, '이성열', 2, 2, 2, 1.000),
    (42, '정진호', 2, 2, 2, 1.000),
    (43, '장운호', 2, 1, 1, 0.500),
    (44, '임종찬', 2, 2, 2, 1.000),
    (45, '김민우', 2, 2, 2, 1.000),
--  롯데 자이언츠
    (46, '정훈', 2, 2, 2, 1.000),
    (47, '손아섭', 2, 0, 2, 0.000),
    (48, '전준우', 2, 2, 2, 1.000),
    (49, '이대호', 2, 2, 2, 1.000),
    (50, '마차도', 2, 2, 2, 1.000),
    (51, '오윤석', 2, 2, 2, 1.000),
    (52, '이병규', 2, 1, 1, 0.500),
    (53, '김준태', 2, 0, 2, 0.000),
    (54, '노경은', 2, 2, 2, 1.000);

INSERT INTO player
    (player_name, team, record)
VALUES
--  두산 베어스
    ('허경민', '두산 베어스',1),
    ('오재원', '두산 베어스',2),
    ('페르난데스', '두산 베어스',3),
    ('박건우', '두산 베어스',4),
    ('조수행', '두산 베어스',5),
    ('김재환', '두산 베어스',6),
    ('안권수', '두산 베어스',7),
    ('권민석', '두산 베어스',8),
    ('유희관', '두산 베어스',9),
--  SSG 랜더스
    ('최정', 'SSG 랜더스',10),
    ('추신수', 'SSG 랜더스',11),
    ('김성현', 'SSG 랜더스',12),
    ('로맥', 'SSG 랜더스',13),
    ('오태곤', 'SSG 랜더스',14),
    ('정의윤', 'SSG 랜더스',15),
    ('김강민', 'SSG 랜더스',16),
    ('이재원', 'SSG 랜더스',17),
    ('김광현', 'SSG 랜더스',18),
-- 기아 타이거즈
    ('나지완', '기아 타이거즈',19),
    ('최형우', '기아 타이거즈',20),
    ('김선빈', '기아 타이거즈',21),
    ('터커', '기아 타이거즈',22),
    ('이우성', '기아 타이거즈',23),
    ('김민식', '기아 타이거즈',24),
    ('나주환', '기아 타이거즈',25),
    ('한승택', '기아 타이거즈',26),
    ('멩덴', '기아 타이거즈',27),
--  키움 히어로즈
    ('이정후', '키움 히어로즈',28),
    ('박병호', '키움 히어로즈',29),
    ('이용규', '키움 히어로즈',30),
    ('허정협', '키움 히어로즈',31),
    ('김혜성', '키움 히어로즈',32),
    ('서건창', '키움 히어로즈',33),
    ('신준우', '키움 히어로즈',34),
    ('프레이타', '키움 히어로즈',35),
    ('최원태', '키움 히어로즈',36),
--  한화 이글스
    ('정은원', '한화 이글스',37),
    ('노수광', '한화 이글스',38),
    ('하주석', '한화 이글스',39),
    ('힐리', '한화 이글스',40),
    ('이성열', '한화 이글스',41),
    ('정진호', '한화 이글스',42),
    ('장운호', '한화 이글스',43),
    ('임종찬', '한화 이글스',44),
    ('김민우', '한화 이글스',45),
--  롯데 자이언츠
    ('정훈', '롯데 자이언츠',46),
    ('손아섭', '롯데 자이언츠',47),
    ('전준우', '롯데 자이언츠',48),
    ('이대호', '롯데 자이언츠',49),
    ('마차도', '롯데 자이언츠',50),
    ('오윤석', '롯데 자이언츠',51),
    ('이병규', '롯데 자이언츠',52),
    ('김준태', '롯데 자이언츠',53),
    ('노경은', '롯데 자이언츠',54);





